import { HttpClient } from '@angular/common/http';
import { Injectable } from '@angular/core';

/*
  Generated class for the AmazonProvider provider.

  See https://angular.io/guide/dependency-injection for more info on providers
  and Angular DI.
*/
@Injectable()
export class AmazonProvider {
  drink:any;
  dessert:any;
  constructor(public http: HttpClient) {
    this.drink=[
           {
             id: 1,
             name: "เอสเปรสโซ่",
             detail: " เอสเปรสโซ่ เมนูกาแฟชนิดหนึ่ง เกิดขึ้นครั้งแรกในประเทศอิตาลี โดยเราเรียกกาแฟเมนูนี้จากหลักการชงกาแฟที่มีการสกัดกาแฟด้วยแรงดัน ไอน้ำ หรือปั้มน้ำเอสเพรสโซ่ดั้งเดิม ที่ทานกันในอิตาลีจะใช้กาแฟ 7-8 กรัม น้ำกาแฟหลังสกัด 25-30 ซีซี รวมครีม่า เวลาในการสกัด 20-30วินาทีโดยชาวอิตาลีมักผสมโรบัสต้าเข้าไป 10% เพื่อช่วยให้ครีม่าเอสเพรสโซ่ดูสวยงามขึ้น แต่ไม่ส่งผลมากับรสชาติ",
             img :"http://www.cafe-amazon.com/BackEnd/TempProducts/2e7cdd9fe39b41d098b7e9fcc5d714f3.png",
             price : "55 บาท",  
           },
          {
            id: 2,
            name: "อเมซอน เอ็กซ์ตร้า",
            detail: "ใช้เมล็ดพันธุ์กาแฟอราบิก้าและโรบัสต้าสายพันธุ์ดีผ่านการคั่วอย่างพิถีพิถันโดยผู้เชี่ยวชาญ ของ Aroma ให้รสชาติเข้มกำลังดี หอม กลมกล่อมเหมาะสำหรับชงร้อน และเย็น",
            img :"http://www.cafe-amazon.com/BackEnd/TempProducts/0e22507dbee6425aa207b8fce3696344.png",
            price : "65 บาท",  
          },
          {
            id: 3,
            name: "แบล็คคอฟฟี่น้ำผึ้งมะนาว",
            detail: "แบล็คคอฟฟี่น้ำผึ้งมะนาว หอมหวานของน้ำผึ้งผสมกับความเปรี้ยวของมะนาว ผสมด้วยกาแฟในสไตล์คาเฟ่ อเมซอน",
            img :"http://www.cafe-amazon.com/BackEnd/TempProducts/2073dca5bb954b4ca29e41dd5ed8b26f.png",
            price : "65 บาท",  
          },
          {
            id: 4,
            name: "คาปูชิโน",
            detail: " มีสีน้ำตาลและฟองนมขาวๆก็คล้ายกับสีผิวของนักบวช บ้างก็ว่าคาปูชิโนมีลักษณะคล้ายกับนักบวชคาปูชินที่มีศีรษะล้าน คาปูชิโนเป็นกาแฟที่มีส่วนผสมของ Expresso อยู่ 1 ส่วน นมร้อนผ่านไอน้ำ (steamed milk) 1 ส่วน และนมตีเป็นฟองละเอียดอีก 1 ส่วน กาแฟคาปูชิโนจะมีรสเข้มกว่าลาเต้ บางทีก็อาจจะตกแต่งด้วย",
            img :"http://www.cafe-amazon.com/BackEnd/TempProducts/ebb8497d26194f67b5a037ffca296870.png",
            price : "60 บาท",  
          },
          {
            id: 5,
            name: "ลาเต้อเมซอน",
            detail: " เป็นภาษาอิตาเลี่ยนแปลว่า “นม” นั่นก็เป็นเพราะว่า มันมีส่วนผสมของกาแฟดำ หรือ  Expresso 1 ส่วนกับนมร้อนอีก 2 ส่วน กาแฟลาเต้อาจมีการหยอดฟองนมเล็กน้อยด้านบนเพื่อเสริมแต่งเป็นลวดลายต่างๆให้มีความสวยงามอีกด้วย เป็นกาแฟที่มีรสนุ่มนวล",
            img :"http://www.cafe-amazon.com/BackEnd/TempProducts/ccc0333b2a514d06adb7fedc8a27066f.png",
            price : "65 บาท",  
          },
          {
            id: 6,
            name: "มอคค่า",
            detail: " เป็นชื่อท่าเรือแห่งหนึ่งในประเทศเยเมน ที่มีการเพาะปลูกกาแฟชนิดนี้นั่นเอง มอคค่าถือว่าเป็นอาราบิก้าชนิดพิเศษแต่มันมีสีและกลิ่นคล้ายช็อกโกแลต นอกจากนี้มอคค่ายังหมายถึงกาแฟที่มีเอสเพรสโซ่และโกโก้เป็นส่วนประกอบ",
            img :"http://www.cafe-amazon.com/BackEnd/TempProducts/a2ba934d790149798e27f19f8a07719c.png",
            price : "65 บาท",  
          },
          {
            id: 7,
            name: "ชาเขียวนม",
            detail: " ชาเขียว คือ ใบ หรือ ยอดต้นชาสด ที่ไม่ผ่านกระบวนการหมัก ใช้วิธีทำให้ใบชาผ่านความร้อน และทำให้แห้งอย่างรวดเร็ว ความร้อนจะเข้าไปยับยั้งการทำงานของเอนไซม์ ทำให้ใบชาไม่ช้ำ สีของใบชาที่แห้งแล้ว จึงยังคงเป็นสีเขียวอยู่ จึงเรียกว่า ชาเขียว",
            img :"http://www.cafe-amazon.com/BackEnd/TempProducts/0080ba22e8a34700b18a7d9165819add.png",
            price : "55 บาท",  
          },
          {
            id: 8,
            name: "ชานม",
            detail: " เครื่องดื่มที่ชงโดยใช้ชาซีลอนชงอย่างเข้มข้น แต่เนื่องจากชาซีลอนมีราคาแพงและมีปลูกเฉพาะที่เท่านั้น จึงนิยมใช้ใบเมี่ยงที่เป็นพันธุ์พื้นเมืองแบบดั้งเดิมหรือแบบที่เกิดขึ้นเองตามธรรมชาติ",
            img :"http://www.cafe-amazon.com/BackEnd/TempProducts/9352e582ef95453f807ea255a5247e73.png",
            price : "50 บาท",  
          },
          {
            id: 9,
            name: "ชามะนาว",
            detail: " ชามะนาว เมนูน้ำดื่มเพื่อความสดชื่น สดชื่นหอมเย็น หอมอร่อยเพื่อสุขภาพ หอมกลิ่นมะนาวเย็นชื่นใจ หอมชาไทยหอมกลิ่นของความเป็นไทย ดื่มเพื่อสุขภาพ เป็นอีกหนึ่งทางเลือกของท่านที่ชอบนิยมดื่มชา เราได้นำเอาชาไทยๆ ของเรา มาชงด้วย วิธีที่ง่ายๆ ไม่ยุ่งยาก เรามีเคล็ดลับคือ เพียงเติมน้ำร้อนลงไป ในผงชา แล้วกรองเอากากชาออก แล้วใส่น้ำตาลลงไป ความหวานตามชอบ ของแต่ละท่าน แล้วใส่น้ำแข็งลงไป เพื่อความเย็นสดชื่น และใส่มะนาวหั่นแว่นลงไป เพื่อเพิ่มความหอมและรสชาติ ที่อร่อยเข้ากัน แค่นี้ท่านก็ได้น้ำดื่มเพื่อสุขภาพ ดื่มชามะนาวหอมๆ หอมอร่อยเพื่อสุขภาพ หอมกลิ่นของความเป็นไทย",
            img :"http://www.cafe-amazon.com/BackEnd/TempProducts/1e21182bbb9e4cd0900fe8ac5b1e9d29.png",
            price : "45 บาท",  
          }
        ];
      
    this.dessert=[
          {
            id: 1,
            name: "เครปโรลฝอยทอง",
            detail: " เมนูของหวานเครปโรลฝอยทอง ครีมนุ่มๆ เต็มปากเต็มคำด้วยฝอยทอง เพียง 50฿ สั่งคู่กับ นมสดเย็น จากอเมซอน อร่อยลืมเครียด",
            img :"https://pbs.twimg.com/media/EHY7EltU4AA9-Jn.jpg",
            price : "55 บาท",  
          },
         {
           id: 2,
           name: "ชิฟฟ่อนมะพร้าวอ่อน",
           detail: "ชิฟฟ่อนเป็นเค้กหวานน้อยสาวๆ มักจะชอบทาน ชิฟฟ่อนสามารถเป็นรสชาติอะไรก็ได้ ที่ขายตามท้องตลาดสีสันสดใสมีหลากหลายไส้ให้เลือก ชิฟฟ่อนมะพร้าวอ่อน หวานน้อยแต่อร่อยมาก",
           img :"https://scontent.fbkk8-2.fna.fbcdn.net/v/t1.0-9/69653661_507868250048211_5824670278436782080_n.jpg?_nc_cat=107&_nc_sid=110474&_nc_eui2=AeEF02zKoAV9vgE5urOWYEnQ6yPZMELM5JfrI9kwQszkl7cWX7cGC3K2F0rbvzHUa2Y7oLKyE_YFQ3zG8FH4Vfgf&_nc_ohc=vmWOEOrbXqMAX8cJysF&_nc_ht=scontent.fbkk8-2.fna&oh=6716275bcee5412ba0604151dd1081bc&oe=5EC7EE36",
           price : "55 บาท",  
         },
         {
           id: 3,
           name: "บราวนี่อบกรอบชาเขียว",
           detail: "ขนมเขียว ๆ หวาน ๆ เนื้อเหนียวหนึบที่ใครยังไม่เคยกินถือว่าพลาด ยิ่งเป็นหน้ามะพร้าวฟู ๆ กรอบ ๆ รับลองว่าลืมไม่ลง",
           img :"https://img.wongnai.com/p/1920x0/2019/11/18/dade7c7855114ffd818d335e4eec98a8.jpg",
           price : "65 บาท",  
         },
         {
           id: 4,
           name: "ขนมไข่",
           detail: " เป็นขนมที่ทำจากไข่ที่ตีจนขึ้นฟู ผสมกับแป้งเค้ก แล้วอบจนสุกเหลืองทอง หน้ากรอบนิด ๆ เนื้อในนุ่มหอมกลิ่นไข่ กินคู่กับกาแฟ หรือนมร้อน ๆ ซักแก้ว รับรองฟินสุด ๆ ",
           img :"https://d1sag4ddilekf6.cloudfront.net/item/THITE2020041309350519431/photos/menueditor_item_a982c1cd13f94456bca685c5a7e0f2ac_1586770488523252208.jpg",
           price : "60 บาท",  
         }
       ];
  }

  loaddrink(){
    return Promise.resolve(this.drink);
    }
  
  Iddrink(Iddrink:any){
    let drink = this.drink.find( ({id}) => id===Iddrink );
      return Promise.resolve(drink);
    }



  loaddessert(){
      return Promise.resolve(this.dessert);
      }
    
  Iddessert(Iddessert:any){
      let dessert = this.dessert.find( ({id}) => id===Iddessert );
        return Promise.resolve(dessert);
      }

}
